#### Terraform Format and Style 🖌`success`
#### alpha - Terraform Initialization ⚙️`success`
#### alpha - Terraform Validation 🤖Success! The configuration is valid.


#### alpha - Terraform Plan 📖`success`

<details><summary>alpha - Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.core-infrastructure.module.k8s-master.data.google_container_engine_versions.cluster_versions: Refreshing state... [id=2020-12-08 15:23:17.298413984 +0000 UTC]
module.core-infrastructure.module.cloud-armor.google_compute_security_policy.policy: Refreshing state... [id=projects/terra-datarepo-alpha/global/securityPolicies/broad-cloud-armor]
module.datarepo-app.module.cloudsql.random_id.cloudsql_id[0]: Refreshing state... [id=ZrUTW1MjlVw]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo-stairway"]: Refreshing state... [id=QUxyb72Vy09NqFV4S6907g]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo"]: Refreshing state... [id=aSD7KqGHxMSyFzonU_-vVA]
module.datarepo-app.module.cloudsql.random_id.root_user_password[0]: Refreshing state... [id=4QU0qQ1b9O7mxK6_dgfFww]
module.enable-services.google_project_service.cloudresourcemanager[0]: Refreshing state... [id=terra-datarepo-alpha/cloudresourcemanager.googleapis.com]
module.core-infrastructure.module.k8s-master.data.google_project.project: Refreshing state... [id=projects/terra-datarepo-alpha]
module.enable-services.google_project_service.serviceusage[0]: Refreshing state... [id=terra-datarepo-alpha/serviceusage.googleapis.com]
module.core-infrastructure.google_compute_ssl_policy.global-ssl-policy: Refreshing state... [id=projects/terra-datarepo-alpha/global/sslPolicies/global-ssl-policy]
module.core-infrastructure.module.k8s-nodes["jade-node-us-central-1"].google_container_node_pool.pool: Refreshing state...
module.enable-services.google_project_service.required-services[15]: Refreshing state... [id=terra-datarepo-alpha/logging.googleapis.com]
module.enable-services.google_project_service.required-services[12]: Refreshing state... [id=terra-datarepo-alpha/storage-component.googleapis.com]
module.enable-services.google_project_service.required-services[1]: Refreshing state... [id=terra-datarepo-alpha/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.required-services[9]: Refreshing state... [id=terra-datarepo-alpha/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[5]: Refreshing state... [id=terra-datarepo-alpha/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[0]: Refreshing state... [id=terra-datarepo-alpha/iamcredentials.googleapis.com]
module.enable-services.google_project_service.required-services[10]: Refreshing state... [id=terra-datarepo-alpha/container.googleapis.com]
module.enable-services.google_project_service.required-services[14]: Refreshing state... [id=terra-datarepo-alpha/stackdriver.googleapis.com]
module.enable-services.google_project_service.required-services[2]: Refreshing state... [id=terra-datarepo-alpha/serviceusage.googleapis.com]
module.enable-services.google_project_service.required-services[7]: Refreshing state... [id=terra-datarepo-alpha/sql-component.googleapis.com]
module.enable-services.google_project_service.required-services[6]: Refreshing state... [id=terra-datarepo-alpha/dns.googleapis.com]
module.enable-services.google_project_service.required-services[4]: Refreshing state... [id=terra-datarepo-alpha/compute.googleapis.com]
module.enable-services.google_project_service.required-services[3]: Refreshing state... [id=terra-datarepo-alpha/genomics.googleapis.com]
module.enable-services.google_project_service.required-services[13]: Refreshing state... [id=terra-datarepo-alpha/servicenetworking.googleapis.com]
module.enable-services.google_project_service.required-services[8]: Refreshing state... [id=terra-datarepo-alpha/monitoring.googleapis.com]
module.enable-services.google_project_service.required-services[11]: Refreshing state... [id=terra-datarepo-alpha/storage-api.googleapis.com]
module.core-infrastructure.google_compute_address.nat-address[0]: Refreshing state... [id=projects/terra-datarepo-alpha/regions/us-central1/addresses/nat-external-0]
module.core-infrastructure.google_compute_network.network[0]: Refreshing state... [id=projects/terra-datarepo-alpha/global/networks/alpha-network]
module.core-infrastructure.google_compute_address.nat-address[1]: Refreshing state... [id=projects/terra-datarepo-alpha/regions/us-central1/addresses/nat-external-1]
module.core-infrastructure.google_compute_subnetwork.subnetwork[0]: Refreshing state... [id=projects/terra-datarepo-alpha/regions/us-central1/subnetworks/alpha-subnet]
module.core-infrastructure.google_compute_router.router[0]: Refreshing state... [id=projects/terra-datarepo-alpha/regions/us-central1/routers/router]
module.core-infrastructure.module.k8s-master.google_container_cluster.cluster: Refreshing state... [id=projects/terra-datarepo-alpha/locations/us-central1/clusters/jade-master-us-central1]
module.core-infrastructure.google_compute_router_nat.nat[0]: Refreshing state... [id=terra-datarepo-alpha/us-central1/router/nat-1]
module.core-infrastructure.module.k8s-nodes["jade-node-us-central-1"].google_container_node_pool.pool: Refreshing state... [id=projects/terra-datarepo-alpha/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-1]
module.datarepo-app.module.cloudsql.google_compute_global_address.private_ip_address[0]: Refreshing state... [id=projects/terra-datarepo-alpha/global/addresses/datarepo-db-jade-private-address]
module.datarepo-app.module.workloadid.google_service_account.user-sql-service-account["alpha"]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/alpha-workload-proxy-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_service_account.datarepo_api_sa[0]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_service_account.datarepo_test_runner_sa[0]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_compute_global_address.global_ip_address: Refreshing state... [id=projects/terra-datarepo-alpha/global/addresses/jade-alpha-ip]
module.datarepo-app.google_service_account.datarepo_sql_sa[0]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-sql@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.google_service_networking_connection.private_vpc_connection[0]: Refreshing state... [id=https%3A%2F%2Fwww.googleapis.com%2Fcompute%2Fv1%2Fprojects%2Fterra-datarepo-alpha%2Fglobal%2Fnetworks%2Falpha-network:servicenetworking.googleapis.com]
module.datarepo-app.google_project_iam_member.api_sa_role[5]: Refreshing state... [id=terra-datarepo-alpha/roles/monitoring.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[7]: Refreshing state... [id=terra-datarepo-alpha/roles/stackdriver.accounts.viewer/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[4]: Refreshing state... [id=terra-datarepo-alpha/roles/logging.logWriter/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[3]: Refreshing state... [id=terra-datarepo-alpha/roles/errorreporting.writer/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.module.workloadid.google_project_iam_member.user-sql-sa-role["alpha"]: Refreshing state... [id=terra-datarepo-alpha/roles/cloudsql.client/serviceaccount:alpha-workload-proxy-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.module.workloadid.google_service_account_key.user-sql-sa-key["alpha"]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/alpha-workload-proxy-sa@terra-datarepo-alpha.iam.gserviceaccount.com/keys/dd05e41cd2077c55c962c9e01f6352f19496b0a0]
module.datarepo-app.module.workloadid.google_service_account_iam_binding.sqlproxy_workload_identity_binding["alpha"]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/alpha-workload-proxy-sa@terra-datarepo-alpha.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-app.google_project_iam_member.api_sa_role[1]: Refreshing state... [id=terra-datarepo-alpha/roles/cloudsql.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[0]: Refreshing state... [id=terra-datarepo-alpha/roles/bigquery.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[9]: Refreshing state... [id=terra-datarepo-alpha/roles/pubsub.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[8]: Refreshing state... [id=terra-datarepo-alpha/roles/storage.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[10]: Refreshing state... [id=terra-datarepo-alpha/roles/container.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[2]: Refreshing state... [id=terra-datarepo-alpha/roles/datastore.user/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[6]: Refreshing state... [id=terra-datarepo-alpha/roles/servicemanagement.serviceController/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.api_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com/keys/62d19e5653cbd6ddb5851e6273e5b4224f82c2ef]
module.datarepo-app.google_project_iam_member.api_sa_role[11]: Refreshing state... [id=terra-datarepo-alpha/roles/resourcemanager.projectIamAdmin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.test_runner_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com/keys/e596a28bf46f6806575db7d21a0898d1bdf65d80]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[1]: Refreshing state... [id=terra-datarepo-alpha/roles/logging.viewer/serviceaccount:datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[2]: Refreshing state... [id=terra-datarepo-alpha/roles/monitoring.viewer/serviceaccount:datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[3]: Refreshing state... [id=terra-datarepo-alpha/roles/secretmanager.admin/serviceaccount:datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[0]: Refreshing state... [id=terra-datarepo-alpha/roles/container.admin/serviceaccount:datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.sql_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-sql@terra-datarepo-alpha.iam.gserviceaccount.com/keys/b27638bf6f8f7b220b1382487176d9f8460faa1d]
module.datarepo-app.google_project_iam_member.sql_sa_role[0]: Refreshing state... [id=terra-datarepo-alpha/roles/cloudsql.client/serviceaccount:datarepo-jade-sql@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0]: Refreshing state... [id=datarepo-db-jade-66b5135b5323955c]
module.datarepo-app.vault_generic_secret.api_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/alpha/datarepo-api-sa]
module.datarepo-app.vault_generic_secret.test_runner_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/alpha/test-runner-sa]
module.datarepo-app.vault_generic_secret.sql_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/alpha/datarepo-sql-sa]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo"]: Refreshing state... [id=projects/terra-datarepo-alpha/instances/datarepo-db-jade-66b5135b5323955c/databases/datarepo]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo-stairway"]: Refreshing state... [id=projects/terra-datarepo-alpha/instances/datarepo-db-jade-66b5135b5323955c/databases/stairway]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo"]: Refreshing state... [id=drmanager//datarepo-db-jade-66b5135b5323955c]
module.datarepo-app.module.cloudsql.google_sql_user.root_user[0]: Refreshing state... [id=root//datarepo-db-jade-66b5135b5323955c]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo-stairway"]: Refreshing state... [id=drmanager//datarepo-db-jade-66b5135b5323955c]
module.datarepo-app.vault_generic_secret.sql_db_password[0]: Refreshing state... [id=secret/dsde/datarepo/alpha/datarepo-sql-db]
module.datarepo-alerts.data.vault_generic_secret.slack_token: Refreshing state... [id=secret/suitable/terraform/stackdriver/slack-token]
module.datarepo-alerts.google_compute_global_address.global_ip_address_grafana: Refreshing state... [id=projects/terra-datarepo-alpha/global/addresses/datarepo-grafana-ip]
module.datarepo-alerts.google_compute_global_address.global_ip_address_prometheus: Refreshing state... [id=projects/terra-datarepo-alpha/global/addresses/datarepo-prometheus-ip]
module.datarepo-alerts.module.uptimecheck.google_monitoring_uptime_check_config.uptime-check-config[0]: Refreshing state... [id=projects/terra-datarepo-alpha/uptimeCheckConfigs/data-alpha-envs-terra-bio]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account.service-account: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0]: Refreshing state... [id=projects/terra-datarepo-alpha/notificationChannels/13640375975922639159]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.node_resource_alerts: Refreshing state... [id=projects/terra-datarepo-alpha/alertPolicies/9870185772218155901]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_health_alert: Refreshing state... [id=projects/terra-datarepo-alpha/alertPolicies/8295498595022934880]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_memory_util: Refreshing state... [id=projects/terra-datarepo-alpha/alertPolicies/15172991372362375938]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_key.service-account-key: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com/keys/fe94124f0f320db237060c852a5c6a78860d960b]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.metricWriter"]: Refreshing state... [id=terra-datarepo-alpha/roles/monitoring.metricWriter/serviceaccount:prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/logging.admin"]: Refreshing state... [id=terra-datarepo-alpha/roles/logging.admin/serviceaccount:prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_iam_binding.workload-identity-binding: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.admin"]: Refreshing state... [id=terra-datarepo-alpha/roles/monitoring.admin/serviceaccount:prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-alerts.module.uptimecheck.google_monitoring_alert_policy.uptime-check[0]: Refreshing state... [id=projects/terra-datarepo-alpha/alertPolicies/1005569643174588287]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      ~ data             = (sensitive value)
      ~ data_json        = (sensitive value)
      ~ id               = "secret/suitable/terraform/stackdriver/slack-token" -> (known after apply)
      ~ lease_duration   = 2764800 -> (known after apply)
      + lease_id         = (known after apply)
      ~ lease_renewable  = false -> (known after apply)
      ~ lease_start_time = "RFC1010109" -> (known after apply)
        path             = "secret/suitable/terraform/stackdriver/slack-token"
      - version          = -1 -> null
    }

  # module.datarepo-alerts.google_logging_metric.logging_metric_error_connections_exhausted will be created
  + resource "google_logging_metric" "logging_metric_error_connections_exhausted" {
      + filter  = <<~EOT
            resource.type="k8s_container"
            AND labels.k8s-pod/app_kubernetes_io/name="datarepo-api"
            AND resource.labels.project_id="terra-datarepo-alpha"
            AND resource.labels.cluster_name="jade-master-us-central1"
            AND severity="ERROR"
            AND (jsonPayload.message:"Global exception handler" AND jsonPayload.message:"org.springframework.jdbc.CannotGetJdbcConnectionException")
        EOT
      + id      = (known after apply)
      + name    = "logging/user/metric_error_connections_exhausted"
      + project = (known after apply)

      + metric_descriptor {
          + metric_kind = "DELTA"
          + unit        = "1"
          + value_type  = "INT64"
        }
    }

  # module.datarepo-alerts.google_monitoring_alert_policy.log_based_alert_policy will be created
  + resource "google_monitoring_alert_policy" "log_based_alert_policy" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Error was detected"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/terra-datarepo-alpha/notificationChannels/13640375975922639159",
        ]
      + project               = "terra-datarepo-alpha"

      + conditions {
          + display_name = "Connections Exhausted"
          + name         = (known after apply)

          + condition_threshold {
              + comparison = "COMPARISON_GT"
              + duration   = "60s"
              + filter     = "metric.type=\"logging/user/metric_error_connections_exhausted}\""

              + aggregations {
                  + alignment_period   = "60s"
                  + per_series_aligner = "ALIGN_DELTA"
                }
            }
        }
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "notification_channel" {
        display_name = "alpha"
        enabled      = true
        id           = "projects/terra-datarepo-alpha/notificationChannels/13640375975922639159"
      ~ labels       = {
          - "auth_token"   = "xoxb-12729891575-1301495169890-SUYNuZWXKWTdFGkT4W07MfGg"
          - "channel_name" = "#jade-alerts"
        } -> (known after apply)
        name         = "projects/terra-datarepo-alpha/notificationChannels/13640375975922639159"
        project      = "terra-datarepo-alpha"
        type         = "slack"
        user_labels  = {}
    }

  # module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0] will be updated in-place
  ~ resource "google_sql_database_instance" "cloudsql_instance" {
        connection_name               = "terra-datarepo-alpha:us-central1:datarepo-db-jade-66b5135b5323955c"
        database_version              = "POSTGRES_11"
        deletion_protection           = true
        first_ip_address              = "10.10.0.2"
        id                            = "datarepo-db-jade-66b5135b5323955c"
        ip_address                    = [
            {
                ip_address     = "10.10.0.2"
                time_to_retire = ""
                type           = "PRIVATE"
            },
        ]
        name                          = "datarepo-db-jade-66b5135b5323955c"
        private_ip_address            = "10.10.0.2"
        project                       = "terra-datarepo-alpha"
        region                        = "us-central1"
        self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/terra-datarepo-alpha/instances/datarepo-db-jade-66b5135b5323955c"
        server_ca_cert                = [
            {
                cert             = <<~EOT
                    -----BEGIN CERTIFICATE-----
                    MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQ1ZmUx
                    MTJjMy05ZGUxLTQ3NTQtYTA1Zi1lNTViZjdhNjAzNWIxIzAhBgNVBAMTGkdvb2ds
                    ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
                    A1UEBhMCVVMwHhcNMjAwNzI5MjEwMjM0WhcNMzAwNzI3MjEwMzM0WjB3MS0wKwYD
                    VQQuEyQ1ZmUxMTJjMy05ZGUxLTQ3NTQtYTA1Zi1lNTViZjdhNjAzNWIxIzAhBgNV
                    BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
                    IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
                    AQDLAr1SEziyi0ipif0A81/yIhm7B/7a3P9RyUmn47Y0/hdi0YuzlTcCbRf3RCxU
                    3n/EL6Dcy90TKJZ+7l0esGS1HXfraJ4jq1h3hGywIAKj4WfFfWqHAKw9dM/fPf2R
                    Kd+vUrijPTLi7x6pWjt1UwoDXx9j+XEM3fkZXp8ewjcfrUY1jGoKW6nvqCXSrTjj
                    hues9vEwuVC8tvHB8HhbIRG/DyxR1mrwuonWrgub0OfQnu9mHGX/71hElOnt0zd0
                    W3ZHGhFN2cfy2xGQ46rxzfovdlQl+gZ3gylASdUxS9lcQAgI75S+gA6xd0X6tz6H
                    Yqdkn4KA7GPFeUwu2x1iK849AgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
                    DQYJKoZIhvcNAQELBQADggEBAFeDL7EYCqJP6S1fmG0JmShXLjUAnsBN7aSbgwbB
                    6wGG12jxTMtnsHRXNwokhFzJs5jZaujQ0KPq3DJEwiBlLt3epS8KXkr3SsSMSOmM
                    z7xCCvqTiDc/mS3v/e5kEM2P4AlPU+/JOyX+tMUhlHE0iJ+LbdQ1DWka51YZHlre
                    xwu0APNQQgGYwTX7OrMK+15vd5vVgohX4/W6qjtVejlxsi6OGIYuA3fPx/KVewzh
                    qQV/TSWzNw/asYUQ1SIjFhOKk+9dtBxrk9PaccrAOl8toCqeVH/gnB3sKMl4kyb1
                    AUQllENxpElvJPMHNuozvYUFEzoczcszgOaRsvQTa5J49j4=
                    -----END CERTIFICATE-----
                EOT
                common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=5fe112c3-9de1-4754-a05f-e55bf7a6035b"
                create_time      = "2020-07-29T21:02:34.050Z"
                expiration_time  = "2030-07-27T21:03:34.050Z"
                sha1_fingerprint = "f6292fc6c64de2fee0044bd9ee6e7a6454135ade"
            },
        ]
        service_account_email_address = "p805595067257-83sky3@gcp-sa-cloud-sql.iam.gserviceaccount.com"

      ~ settings {
            activation_policy           = "ALWAYS"
            authorized_gae_applications = []
            availability_type           = "REGIONAL"
            crash_safe_replication      = false
            disk_autoresize             = true
            disk_size                   = 10
            disk_type                   = "PD_SSD"
            pricing_plan                = "PER_USE"
          + replication_type            = "SYNCHRONOUS"
            tier                        = "db-custom-2-7680"
            user_labels                 = {
                "app" = "datarepo"
                "env" = "jade"
            }
            version                     = 36

            backup_configuration {
                binary_log_enabled             = false
                enabled                        = true
                point_in_time_recovery_enabled = false
                start_time                     = "06:00"
            }

            database_flags {
                name  = "max_connections"
                value = "200"
            }

            ip_configuration {
                ipv4_enabled    = false
                private_network = "projects/terra-datarepo-alpha/global/networks/alpha-network"
                require_ssl     = true
            }

            location_preference {
                zone = "us-central1-a"
            }
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on modules/datarepo-app/cloudsql.tf line 25, in module "cloudsql":
  25:     "${local.service}" = {

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 5 more similar warnings elsewhere)


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @nmalfroy, Action: `pull_request`, Working Directory: `./datarepo`, Workflow: `Terraform Plan`*